АрендаКвартир/src/Documents/УстановкаЦенНаКвартиры/УстановкаЦенНаКвартиры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНаКвартиры</name>
  <registerRecords>InformationRegister.ЦеныНаКвартиры</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЦеныНаКвартиры</name>
    <attributes>
      <name>Квартира</name>
      <type>
        <types>CatalogRef.Квартиры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АрендаКвартир/src/InformationRegisters/ЦеныНаКвартиры/ЦеныНаКвартиры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНаКвартиры</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаЗаДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АрендаКвартир/src/Documents/УстановкаЦенНаКвартиры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ЦеныНаКвартиры
	Движения.ЦеныНаКвартиры.Записывать = Истина;
	Для Каждого ТекСтрокаЦеныНаКвартиры из ЦеныНаКвартиры Цикл
		Движение = Движения.ЦеныНаКвартиры.Добавить();
		Движение.Квартира = ТекСтрокаЦеныНаКвартиры.Квартира;
		Движение.ЦенаЗаДень = ТекСтрокаЦеныНаКвартиры.ЦенаЗаДень;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
